Revit 2026 API

# BRepBuilderIsPermittedSurfaceType Method

---

A validator function that checks whether the surface object is of type supported as face surface by BRepBuilder.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsPermittedSurfaceType(
	Surface surface
)
```
```vb
Public Shared Function IsPermittedSurfaceType (
	surface As Surface
) As Boolean
```
```cpp
public:
static bool IsPermittedSurfaceType(
	Surface^ surface
)
```
```fsharp
static member IsPermittedSurfaceType :
        surface : Surface -> bool
```

#### Parameters

surface Surface
     Surface object intended to be used as a face surface.

#### Return Value

Boolean True if a surface of this type may be used as a face surface, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The allowed surface types are ConicalSurface, CylindricalSurface, Plane, RevolvedSurface, RuledSurface, and HermiteSurface.

#### Reference

BRepBuilder Class

Autodesk.Revit.DB Namespace